---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.ExceedMaxDrivenGridlines
source: html/bdf311ea-38d9-7543-0f80-7bef44da4e91.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.ExceedMaxDrivenGridlines Property

Changes have been made that cause a curtain wall with type driven grid lines to exceed the maximum allowed number of type driven lines (200 in direction (1) and 200 in direction (2)). If you really need this many type driven grid lines, please split the affected wall before proceeding.

## Syntax (C#)
```csharp
public static FailureDefinitionId ExceedMaxDrivenGridlines { get; }
```